content/posts/hsia_principle_1981.md
+++
title = "hsia_principle_1981 | On the Principle of Transference In Three-Dimensional Kinematics"
author = ["João Gutemberg Farias"]
draft = false
+++

## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

O trabalho mostra uma forma de transformar uma matriz de transformação dual em um par com uma matriz de transformação e um vetor posição. O autor usa isso pra converter "dual instantaneous invariants" (baseadas em retas) para "instantaneous invariants" (baseadas em pontos). Isso de alguma forma tem a ver com trajetórias de retas e trajetórias de pontos respectivamente.

[Screw Calculus]({{< relref "screw_calculus" >}}) parece ser um tema interessante. Será que tem alguma ligação com [Dynamics Extension for Davies Method]({{< relref "dynamics_extension_for_davies_method" >}})? Vale a pena analisar.


### [A]={[I] + e[D])[A] {#a-i-plus-e-d--a}

Interessante que a transformação de uma [matriz de transformação dual]({{< relref "dual_transformation_matrix" >}}) pra um par com [matriz de transformação]({{< relref "transformation_matrix" >}}) mais vetor posição não é complicada e se dá por meio de uma [skew-symmetric matrix]({{< relref "skew_symmetric_matrix" >}}). E que o autor se refere a essa transformação como [Transference Principle]({{< relref "transference_principle" >}}).
